{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>'\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "trainable": true}}, {"class_name": "Cropping2D", "config": {"data_format": "channels_last", "cropping": [[75, 25], [0, 0]], "name": "cropping2d_1", "trainable": true}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0002\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0003\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0002\u0000|\u0002\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000|\u0001\u0000\u0083\u0002\u0000S)\u0002N\u00e9\u0000\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0003\u00da\u0003imgZ\u000bresize_dims\u00da\u0002tf\u00a9\u0000r\u0007\u0000\u0000\u0000\u00faH/Users/ilitton/Desktop/Udacity/CarND-Behavioral-Cloning-P3/preprocess.py\u00da\u000bresize_imgs\u0006\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", [[66, 200]], null], "output_shape": null, "name": "lambda_2", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "use_bias": true, "name": "conv2d_1", "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "activation": "elu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "use_bias": true, "name": "conv2d_2", "filters": 36, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "activation": "elu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "use_bias": true, "name": "conv2d_3", "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "activation": "elu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "padding": "valid", "use_bias": true, "name": "conv2d_4", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "activation": "elu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "padding": "valid", "use_bias": true, "name": "conv2d_5", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "activation": "elu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}, "kernel_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "elu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 100, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "elu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 50, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "elu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 10, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999974752427e-07, "l1": 0.0}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 1, "kernel_regularizer": null}}], "keras_version": "2.0.8", "backend": "tensorflow"}